In [1]:
import pandas as pd

df = pd.read_csv("employees.csv")
df.head()

   emp_id     name department  salary  experience
0     101    Alice         HR   60000           3
1     103      Bob         IT   80000           5
2     102  Charlie    Finance   70000           4
3     105    David         IT   90000           7
4     104      Eva         HR   65000           3

In [ ]:
df.sort_index()
import pandas as pd

df = pd.read_csv("employees.csv")
df.head()
# ðŸ‘‰ Since CSV index is already 0,1,2â€¦ you wonâ€™t see much change unless we change the index

   emp_id     name department  salary  experience
0     101    Alice         HR   60000           3
1     103      Bob         IT   80000           5
2     102  Charlie    Finance   70000           4
3     105    David         IT   90000           7
4     104      Eva         HR   65000           3

In [9]:
# Set emp_id as index
df_indexed = df.set_index("emp_id")
df_indexed.head()

           name department  salary  experience
emp_id
101       Alice         HR   60000           3
103         Bob         IT   80000           5
102     Charlie    Finance   70000           4
105       David         IT   90000           7
104         Eva         HR   65000           3

In [10]:
df_indexed.sort_index()

           name department  salary  experience
emp_id
101       Alice         HR   60000           3
102     Charlie    Finance   70000           4
103         Bob         IT   80000           5
104         Eva         HR   65000           3
105       David         IT   90000           7

In [12]:
# Sort index in descending order
# Use sort_index() when index matters (time-series, IDs, etc.)
df_indexed.sort_index(ascending=False)

           name department  salary  experience
emp_id
105       David         IT   90000           7
104         Eva         HR   65000           3
103         Bob         IT   80000           5
102     Charlie    Finance   70000           4
101       Alice         HR   60000           3